Repository: BrainStation-23/Vocario
Catalog: lib/core/l10n/app_*.arb
Languages: bn

# welcomeTitle
source: Welcome to Vocario
bn: ভোকারিওতে স্বাগতম

# welcomeSubtitle
source: AI-powered audio summarization at your fingertips
bn: আপনার হাতের মুঠোয় এআই-চালিত অডিও সারসংক্ষেপ

source: Import Audio
bn: অডিও ইম্পোর্ট

source: Import Video
bn: ভিডিও ইম্পোর্ট

source: Import Media
bn: মিডিয়া ইম্পোর্ট

source: Record
bn: রেকর্ড

source: Settings
bn: সেটিংস

source: Appearance
bn: থিম

source: Dark Mode
bn: ডার্ক মোড

source: Language
bn: ভাষা

# bengali
source: বাংলা (Bengali)
bn: বাংলা (Bangla)

# settingsSubtitle
source: Configure your app preferences
bn: আপনার অ্যাপের পছন্দগুলি কনফিগার করুন

# emailAddress
source: Email Address (Optional)
bn: ইমেইল (ঐচ্ছিক)

# emailDescription
source: Pre-fill your email when sharing meeting summaries
bn: মিটিং সারাংশ শেয়ার করার সময় আপনার ইমেইল প্রি-ফিল করুন

source: Gemini API Key
bn: জেমিনি এপিআই কী

# apiKeyHint
source: Enter your Gemini API key
bn: আপনার জেমিনি এপিআই কী লিখুন

# getApiKey
source: Get your API key from Google AI Studio
bn: গুগল এআই স্টুডিও থেকে আপনার এপিআই কী নিন

# apiKeyInfo
source: Your API key is stored locally on your device and never shared. It's required for generating meeting summaries.
bn: আপনার এপিআই কী আপনার ডিভাইসে স্থানীয়ভাবে সংরক্ষিত এবং কখনো শেয়ার করা হয় না। মিটিং সারাংশ তৈরির জন্য এটি প্রয়োজনীয়।

source: About Us
bn: আমাদের সম্পর্কে

source: Our Mission
bn: আমাদের লক্ষ্য

source: Our Vision
bn: আমাদের দৃষ্টিভঙ্গি

# whyWeBuildVocario
source: Why We Built Vocario
bn: কেন আমরা ভোকারিও তৈরি করেছি

source: Contact Us
bn: যোগাযোগ করুন

source: Website
bn: ওয়েবসাইট

source: Email
bn: ইমেইল

# companyName
source: Brain Station 23
bn: ব্রেইন স্টেশন ২৩

# companyTagline
source: Leading Software Development & IT Service Provider
bn: শীর্ষস্থানীয় সফটওয়্যার ডেভেলপমেন্ট ও আইটি সেবা প্রদানকারী

# missionContent
source: Your trusted companion for digital leadership by empowering people to achieve more with less
bn: কম সম্পদ দিয়ে বেশি অর্জনে মানুষকে ক্ষমতায়নের মাধ্যমে ডিজিটাল নেতৃত্বের জন্য আপনার বিশ্বস্ত সহযোগী

# visionContent
source: To be the fastest digital transformation and innovation partner by engaging global talents thus creating positive impact.
bn: বিশ্বব্যাপী প্রতিভা নিয়োগের মাধ্যমে ইতিবাচক প্রভাব সৃষ্টি করে দ্রুততম ডিজিটাল রূপান্তর ও উদ্ভাবন অংশীদার হওয়া।

# appPurposeContent
source: We developed Vocario as part of our commitment to serve our country by providing innovative solutions that help people communicate more effectively and efficiently through voice technology.
bn: আমরা ভোকারিও তৈরি করেছি আমাদের দেশের সেবায় অবদান রাখার অঙ্গীকারের অংশ হিসেবে, যা মানুষকে ভয়েস প্রযুক্তির মাধ্যমে আরও কার্যকর ও দক্ষভাবে যোগাযোগ করতে সাহায্য করে।

# copyright
source: © 2024 Brain Station 23 PLC. All rights reserved.
bn: © ২০২৫ ব্রেইন স্টেশন ২৩। সকল অধিকার সংরক্ষিত।

source: Analyzing...
bn: বিশ্লেষণ করা হচ্ছে...

source: Select Usage Context
bn: ব্যবহারের প্রসঙ্গ নির্বাচন করুন

source: Doctor Consultation
bn: ডাক্তারি পরামর্শ

source: Meeting Minutes
bn: মিটিং মিনিটস

source: Lecture Summary
bn: লেকচার সারসংক্ষেপ

source: Cooking Instructions
bn: রান্নার নির্দেশনা

# doctorConsultationDescription
source: Summarize medical consultations with structured clinical information
bn: কাঠামোগত ক্লিনিকাল তথ্য সহ চিকিৎসা পরামর্শের সারসংক্ষেপ

# meetingMinutesDescription
source: Generate structured meeting summaries with action items and decisions
bn: কর্মপরিকল্পনা ও সিদ্ধান্ত সহ কাঠামোগত মিটিং সারসংক্ষেপ তৈরি করুন

# lectureSummaryDescription
source: Create educational summaries with key concepts and learning points
bn: মূল ধারণা ও শিক্ষণীয় বিষয় সহ শিক্ষামূলক সারসংক্ষেপ তৈরি করুন

# cookingInstructionsDescription
source: Extract step-by-step cooking instructions with ingredients and techniques
bn: উপাদান ও কৌশল সহ ধাপে ধাপে রান্নার নির্দেশনা বের করুন

# reanalysisFailed
source: Reanalysis failed. Previous analysis restored.
bn: পুনঃবিশ্লেষণ ব্যর্থ। পূর্ববর্তী বিশ্লেষণ পুনরুদ্ধার করা হয়েছে।

# recordingDeletedSuccessfully
source: Recording and analysis deleted successfully
bn: রেকর্ডিং এবং বিশ্লেষণ সফলভাবে মুছে ফেলা হয়েছে

# failedToDelete
source: Failed to delete: {error}
bn: মুছে ফেলতে ব্যর্থ: {error}

# usageContextDescription
source: Choose the type of content you're recording to get the best summarization results.
bn: সর্বোত্তম সারসংক্ষেপ ফলাফল পেতে আপনি যে ধরনের কন্টেন্ট রেকর্ড করছেন তা বেছে নিন।

source: Cancel
bn: বাতিল

source: Recording Mode
bn: রেকর্ডিং মোড

source: Change
bn: পরিবর্তন

source: API Key Required
bn: API কী প্রয়োজন

# apiKeyDescription
source: To analyze your audio recordings, Vocario needs a Gemini API key. This key is stored securely on your device and is only used to process your audio content.
bn: আপনার অডিও রেকর্ডিং বিশ্লেষণ করতে, ভোকারিওর একটি জেমিনি API কী প্রয়োজন। এই কীটি আপনার ডিভাইসে নিরাপদে সংরক্ষিত থাকে এবং শুধুমাত্র আপনার অডিও কন্টেন্ট প্রক্রিয়া করতে ব্যবহৃত হয়।

# apiKeySecurityInfo
source: • Your API key is stored locally and encrypted • No data is shared with third parties • You maintain full control over your API usage
bn: • আপনার API কী স্থানীয়ভাবে সংরক্ষিত এবং এনক্রিপ্ট করা • কোনো ডেটা তৃতীয় পক্ষের সাথে শেয়ার করা হয় না • আপনি আপনার API ব্যবহারের উপর সম্পূর্ণ নিয়ন্ত্রণ বজায় রাখেন

source: Go to Settings
bn: সেটিংসে যান

source: Analysis Results
bn: বিশ্লেষণের ফলাফল

source: Share Options
bn: শেয়ার অপশন

# shareOptionsDescription
source: What would you like to share?
bn: আপনি কী শেয়ার করতে চান?

source: Share Audio File
bn: অডিও ফাইল শেয়ার করুন

source: Share Analysis Text
bn: বিশ্লেষণ টেক্সট শেয়ার করুন

source: No Analysis Available
bn: কোনো বিশ্লেষণ উপলব্ধ নেই

# startAnalysisMessage
source: Start analysis to get insights from your recording
bn: আপনার রেকর্ডিং থেকে অন্তর্দৃষ্টি পেতে বিশ্লেষণ শুরু করুন

source: Duration
bn: সময়কাল

source: Created
bn: তৈরি

source: Audio Player
bn: অডিও প্লেয়ার

source: Recording Details
bn: রেকর্ডিং বিবরণ

source: Recording not found
bn: রেকর্ডিং পাওয়া যায়নি

source: Failed to load recording
bn: রেকর্ডিং লোড করতে ব্যর্থ

source: Recording Information
bn: রেকর্ডিং তথ্য

source: File Name
bn: ফাইলের নাম

source: File Size
bn: ফাইলের আকার

source: Reanalyze
bn: পুনঃবিশ্লেষণ

source: Share
bn: শেয়ার

source: Delete
bn: মুছুন

source: Analysis Complete
bn: বিশ্লেষণ সম্পূর্ণ

# aiProcessingMessage
source: AI is processing your recording...
bn: AI আপনার রেকর্ডিং প্রক্রিয়া করছে...

# processingTimeMessage
source: This may take a few moments
bn: এটি কয়েক মুহূর্ত সময় নিতে পারে

source: No recordings yet
bn: এখনো কোনো রেকর্ডিং নেই

# startRecordingMessage
source: Start recording to see your summaries here
bn: এখানে আপনার সারসংক্ষেপ দেখতে রেকর্ডিং শুরু করুন

source: Failed to load recordings
bn: রেকর্ডিং লোড করতে ব্যর্থ

source: Delete Recording
bn: রেকর্ডিং মুছুন

# deleteConfirmationMessage
source: Are you sure you want to delete this recording and its analysis? This action cannot be undone.
bn: আপনি কি নিশ্চিত যে আপনি এই রেকর্ডিং এবং এর বিশ্লেষণ মুছতে চান? এই কাজটি পূর্বাবস্থায় ফেরানো যাবে না।

source: Audio file not found
bn: অডিও ফাইল পাওয়া যায়নি

# failedToShareAudioFile
source: Failed to share audio file: {error}
bn: অডিও ফাইল শেয়ার করতে ব্যর্থ: {error}

# noAnalysisContentToShare
source: No analysis content available to share
bn: শেয়ার করার জন্য কোন বিশ্লেষণ বিষয়বস্তু উপলব্ধ নেই

# failedToShareAnalysisText
source: Failed to share analysis text: {error}
bn: বিশ্লেষণ টেক্সট শেয়ার করতে ব্যর্থ: {error}

source: Audio Analysis Results
bn: অডিও বিশ্লেষণ ফলাফল

source: Dismiss
bn: বাতিল

# audioRecordingFrom
source: Audio recording from {date}
bn: {date} থেকে অডিও রেকর্ডিং

# couldNotLaunch
source: Could not launch {url}
bn: {url} চালু করা যায়নি

# pleaseEnterApiKey
source: Please enter an API key
bn: অনুগ্রহ করে একটি API কী প্রবেশ করান

source: API key saved successfully
bn: API কী সফলভাবে সংরক্ষিত হয়েছে

source: Failed to save API key
bn: API কী সংরক্ষণ করতে ব্যর্থ

# tipMessage
source: Tip: For best results, ensure clear audio quality and minimal background noise.
bn: টিপ: সর্বোত্তম ফলাফলের জন্য, স্পষ্ট অডিও গুণমান এবং ন্যূনতম পটভূমির শব্দ নিশ্চিত করুন।

source: Summaries
bn: সারসংক্ষেপ

source: Analysis failed
bn: বিশ্লেষণ ব্যর্থ

source: Failed to import media
bn: মিডিয়া ইম্পোর্ট করতে ব্যর্থ

source: Failed to analyze media
bn: মিডিয়া বিশ্লেষণ করতে ব্যর্থ

source: Analysis in Progress
bn: বিশ্লেষণ চলমান

# analysisInProgressMessage
source: Audio analysis is currently in progress. If you leave now, the progress will be lost and the operation will be cancelled.
bn: অডিও বিশ্লেষণ বর্তমানে চলমান। আপনি এখন চলে গেলে, অগ্রগতি হারিয়ে যাবে এবং অপারেশন বাতিল হয়ে যাবে।

source: Leave Anyway
bn: যাইহোক চলে যান
